---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.String.Url
source: html/3609d7f8-e96e-2e38-f60e-65c68873b62f.htm
---
# Autodesk.Revit.DB.SpecTypeId.String.Url Property

URL, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Url { get; }
```